print("***算数运算符***")
-- + - * / %
--无自增自减 ++ -- 无复合运算 += -= *= /= %=
--字符串 可以进行 算术运算符操作 会自动转换成number
print("123"+1);
print("123"-1);
print("123"*2);
print("123"/2);
print("123"%2); --取余数
print("20"^2); --^ lua中为幂运算

print("***条件运算符***")
-- < > <= >= == ~=不等于
print(3>1);

print("***逻辑运算符***")
-- and or not 相当于 && ||  ! --支持"短路"规则：前面满足，之后不会运行
print(true and print("165"));   --输出nil，会打印之后的print
print(false and print("465"));  --输出false 不会再管之后的print("465")

print("***位运算符***")
--不支持运算符
-- & | C#中

print("***三目运算符***")
--也不支持
-- ?:
